-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 25, 2023 at 04:48 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `thesis`
--

-- --------------------------------------------------------

--
-- Table structure for table `data_new`
--

CREATE TABLE `data_new` (
  `id` int(11) NOT NULL,
  `age` int(2) DEFAULT NULL,
  `gender` varchar(5) DEFAULT NULL,
  `education` int(1) DEFAULT NULL,
  `status_` int(1) DEFAULT NULL,
  `dis_type` int(1) DEFAULT NULL,
  `tool` varchar(18) DEFAULT NULL,
  `keeper` int(1) DEFAULT NULL,
  `invest` int(1) DEFAULT NULL,
  `loan` int(1) DEFAULT NULL,
  `hobby` varchar(200) DEFAULT NULL,
  `aptitude` varchar(200) DEFAULT NULL,
  `commute` varchar(200) DEFAULT NULL,
  `occupation` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `data_new`
--

INSERT INTO `data_new` (`id`, `age`, `gender`, `education`, `status_`, `dis_type`, `tool`, `keeper`, `invest`, `loan`, `hobby`, `aptitude`, `commute`, `occupation`) VALUES
(1, 40, 'ชาย', 5, 1, 5, 'ไม้ค้ำยัน', 7, 1, 2, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างซ่อมเครื่องยนต์'),
(2, 63, 'ชาย', 2, 5, 5, 'ไม่มี', 3, 2, 2, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม', 'ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'ช่างซ่อมรถ, ช่างตัดผม'),
(3, 55, 'ชาย', 3, 1, 5, 'ไม้ค้ำยัน', 4, 4, 2, 'เล่นกีฬา/ออกกำลังกาย', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ขับรถรับจ้าง'),
(4, 38, 'หญิง', 3, 3, 6, 'วิลแชร์​', 6, 1, 2, 'ปลูกต้นไม้', 'ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(5, 56, 'หญิง', 3, 1, 5, 'ไม่มี', 7, 3, 3, 'เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(6, 43, 'หญิง', 5, 3, 5, 'ไม่มี', 7, 3, 3, 'ทำอาหาร', 'ด้านภาษา, ด้านมนุษย์สัมพันธ์', 'รถยนต์ส่วนตัว, รถจักรยานยนต์ส่วนตัว', 'แม่ค้า'),
(7, 54, 'ชาย', 3, 3, 6, 'วิลแชร์​', 5, 4, 3, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่​'),
(8, 54, 'ชาย', 3, 3, 6, 'วิลแชร์​', 5, 4, 3, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่, ​ซ่อม​เครื่อง​ยนต์​การเกษตร​'),
(9, 41, 'หญิง', 6, 3, 5, 'ไม่มี', 7, 1, 3, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านประกอบอาหาร, ด้านคอมพิวเตอร์', 'เดินเท้า', 'พนักงานรัฐวิสาหกิจ'),
(10, 46, 'ชาย', 5, 3, 5, 'ไม่มี', 7, 1, 3, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านมนุษย์สัมพันธ์', 'เดินเท้า', 'รับจ้างทั่วไป'),
(11, 28, 'หญิง', 3, 3, 3, 'เครื่องช่วยฟัง', 7, 1, 4, 'เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร, ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(12, 64, 'ชาย', 2, 1, 3, 'ไม่มี', 4, 3, 4, 'เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'เกษตรกร'),
(13, 37, 'หญิง', 6, 1, 5, 'ไม่มี', 7, 1, 4, 'เลี้ยงสัตว์', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(14, 30, 'หญิง', 3, 1, 4, 'เขียนพิมพ์สื่อสาร', 7, 2, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง,', 'ด้านศิลปะ/การช่าง', 'เดินเท้า', 'พนักงานบริษัท kcf'),
(15, 33, 'หญิง', 1, 2, 6, 'วิลแชร์​', 7, 2, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ทำอาหาร, เลี้ยงสัตว์', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'รับจ้างทั่วไป'),
(16, 32, 'อื่นๆ', 6, 1, 5, 'ขาเทียม', 7, 3, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, แต่งรถ', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'ไรเดอร์ส่งอาหาร'),
(17, 42, 'หญิง', 3, 1, 5, 'ไม้ค้ำยัน', 4, 3, 1, 'ไม่มี', 'ไม่มี', 'ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่ออนไลน์'),
(18, 71, 'ชาย', 2, 1, 5, 'ไม่มี', 4, 3, 1, 'ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(19, 32, 'ชาย', 6, 3, 5, 'ขาเทียม', 1, 5, 1, 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'ติดรถผู้อื่นไปทำงาน', 'รับจ้างทำการเกษตร'),
(20, 31, 'ชาย', 6, 3, 5, 'ขาเทียม', 1, 5, 1, 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'รถยนต์ส่วนตัว', 'พนักงาน'),
(21, 60, 'ชาย', 3, 1, 6, 'วิลแชร์​', 7, 5, 1, 'ขับเคลื่อนงานด้านองค์กรคนพิการ', 'ด้านศิลปะ/การช่าง', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(22, 57, 'ชาย', 3, 3, 5, 'ไม้ค้ำยัน', 7, 5, 1, 'ดูหนังและฟังเพลง', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักลงทุน'),
(24, 39, 'ชาย', 6, 3, 5, 'ไม่มี', 1, 1, 1, 'เล่นกีฬา/ออกกำลังกาย, ทำอาหาร', 'ด้านกีฬา', 'รถจักรยานยนต์ส่วนตัว', 'ธุรกิจส่วนตัว'),
(25, 35, 'หญิง', 6, 3, 3, 'เครื่องช่วยฟัง', 1, 1, 1, 'เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'จักรยาน', 'พนักงานเอกชน'),
(26, 45, 'หญิง', 6, 5, 3, 'เครื่องช่วยฟัง', 1, 1, 1, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ทำเอกสาร'),
(27, 42, 'ชาย', 3, 3, 5, 'ไม่มี', 2, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'ช่างไฟฟ้าและเขียนแบบAutocad'),
(28, 47, 'ชาย', 2, 1, 5, 'ไม่มี', 4, 1, 1, 'ทำอาหาร', 'ด้านศิลปะ/การช่าง', 'เดินเท้า', 'พนักงานโรงงาน'),
(29, 57, 'ชาย', 3, 1, 5, 'ไม่มี', 4, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'ขับแท็กซี่'),
(30, 44, 'ชาย', 3, 3, 1, 'ไม่มี', 1, 1, 1, 'รับจ้างส่งของ', 'ด้านการเคลื่อนไหว', 'รถยนต์ส่วนตัว', 'รับจ้างส่งของ'),
(31, 27, 'ชาย', 6, 3, 9, 'ไม่มี', 1, 1, 1, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'พนักงานเสิร์ฟอาหาร'),
(32, 68, 'หญิง', 2, 1, 6, 'ไม่มี', 7, 1, 1, 'ทำอาหาร', 'ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(33, 79, 'หญิง', 2, 1, 5, 'ไม้เท้า', 7, 1, 1, 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(34, 43, 'หญิง', 3, 1, 5, 'ไม่มี', 7, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร', 'ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'เย็บผ้า ปักผ้า'),
(35, 50, 'ชาย', 3, 1, 5, 'ไม่มี', 7, 1, 1, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(36, 40, 'หญิง', 7, 1, 5, 'ไม่มี', 7, 1, 1, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านภาษา, ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(37, 29, 'หญิง', 6, 3, 5, 'ขาเทียม, ไม้ค้ำยัน', 7, 1, 1, 'ไม่มี', 'ด้านตรรกะ, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(38, 27, 'หญิง', 6, 3, 5, 'ไม่มี', 7, 1, 1, 'เลี้ยงสัตว์', 'ด้านภาษา', 'รถยนต์ส่วนตัว', 'พนักงานออฟฟิศ'),
(39, 30, 'หญิง', 6, 3, 5, 'ไม่มี', 7, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(40, 35, 'อื่นๆ', 6, 3, 5, 'ไม่มี', 7, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'โปรแกรมเมอร์​'),
(41, 31, 'ชาย', 6, 3, 5, 'ไม่มี', 7, 1, 1, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'รถโดยสารประจำทาง, เดินเท้า', 'เก็บขยะ'),
(42, 51, 'ชาย', 5, 3, 5, 'ไม่มี', 7, 1, 1, 'ปลูกต้นไม้', 'ด้านดนตรี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(43, 28, 'ชาย', 5, 3, 5, 'ไม่มี', 7, 1, 1, 'ทำอาหาร', 'ด้านภาษา', 'เดินเท้า', 'พนักงานส่งของเคอรี่'),
(44, 43, 'ชาย', 3, 3, 5, 'ไม่มี', 7, 1, 1, 'ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์', 'รถโดยสารประจำทาง', 'รับจ้างขายของ หรือทำความสะอาด'),
(45, 47, 'ชาย', 1, 3, 5, 'ไม่มี', 7, 1, 1, 'ไม่มี', 'ไม่มี', 'เดินเท้า', 'รับจ้างทั่วไป'),
(46, 55, 'ชาย', 7, 3, 5, 'ไม้เท้า, วิลแชร์', 7, 1, 1, 'เลี้ยงสัตว์', 'ด้านภาษา', 'ทำงานที่บ้าน (WFH)', 'ทำงานตรวจสอบและวิเคราะห์'),
(47, 37, 'หญิง', 5, 1, 3, 'ไม่มี', 7, 1, 1, 'ไม่มี', 'ด้านการเคลื่อนไหว, ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'แม่บ้าน'),
(48, 36, 'อื่นๆ', 6, 3, 3, 'เครื่องช่วยฟัง', 7, 1, 1, 'เสริมสวย/แต่งหน้า/ทำผม', 'ด้านคอมพิวเตอร์', 'ทำงานที่บ้าน (WFH)', 'เจ้าหน้าที่ธุรการ'),
(49, 60, 'หญิง', 5, 3, 3, 'ไม่มี', 7, 1, 1, 'ทำอาหาร', 'ด้านคอมพิวเตอร์', 'รถโดยสารประจำทาง', 'พนักงานเอกชน'),
(50, 36, 'ชาย', 6, 1, 1, 'ไม่มี', 7, 1, 1, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'ทำงานที่บ้าน (WFH)', 'ขายล็อตเตอรี่ เล่นดนตรี และทำงานบริษัท'),
(51, 65, 'ชาย', 2, 3, 1, 'ไม่มี', 7, 1, 1, 'เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'เดินเท้า', 'รับจ้างทั่วไป'),
(52, 25, 'หญิง', 6, 3, 2, 'ไม้เท้า', 7, 1, 1, 'ไม่มี', 'ด้านภาษา', 'รถโดยสารประจำทาง', 'พนักงานราชการ'),
(53, 41, 'ชาย', 5, 3, 2, 'ไม่มี', 7, 1, 1, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'นักดนตรี'),
(54, 28, 'ชาย', 6, 3, 7, 'ไม่มี', 7, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักวาดภาพ'),
(55, 60, 'ชาย', 2, 1, 5, 'ขาเทียม', 3, 1, 1, 'เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถยนต์ส่วนตัว', 'พนักงานฟาร์มปศุสัตว์'),
(56, 49, 'หญิง', 2, 5, 5, 'ไม้เท้า', 3, 1, 1, 'ไม่มี', 'ด้านค้าขาย', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(59, 22, 'หญิง', 6, 3, 9, 'ไม่มี', 2, 1, 1, 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม, เล่นดนตรี/ร้องเพลง, ทำอาหาร', 'ด้านคอมพิวเตอร์, ด้านตรรกะ, ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว, รถโดยสารประจำทาง, ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่');

-- --------------------------------------------------------

--
-- Table structure for table `data_newer`
--

CREATE TABLE `data_newer` (
  `ID` int(11) NOT NULL,
  `gender` varchar(5) DEFAULT NULL,
  `education` int(1) DEFAULT NULL,
  `status_` varchar(10) DEFAULT NULL,
  `dis_type` int(1) DEFAULT NULL,
  `tool` int(1) DEFAULT NULL,
  `keeper` varchar(17) DEFAULT NULL,
  `hobby` varchar(68) DEFAULT NULL,
  `aptitude` varchar(63) DEFAULT NULL,
  `commute` varchar(35) DEFAULT NULL,
  `occupation` varchar(42) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `data_newer`
--

INSERT INTO `data_newer` (`ID`, `gender`, `education`, `status_`, `dis_type`, `tool`, `keeper`, `hobby`, `aptitude`, `commute`, `occupation`) VALUES
(1, 'ชาย', 5, 'สมรส', 3, 5, 'ไม่มี', 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างซ่อมเครื่องยนต์'),
(2, 'ชาย', 2, 'สมรส', 8, 7, 'ไม่มี', 'ขับเคลื่อนงานด้านองค์กรคนพิการ', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(3, 'ชาย', 3, 'โสด', 3, 5, 'ไม่มี', 'ดูหนังและฟังเพลง', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักลงทุน'),
(4, 'อื่นๆ', 6, 'สมรส', 3, 6, 'ไม่มี', 'ทำงานประดิษฐ์/งานช่าง, แต่งรถ', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ไรเดอร์ส่งอาหาร'),
(5, 'อื่นๆ', 6, 'โสด', 3, 1, 'ไม่มี', 'ทำงานประดิษฐ์/งานช่าง, เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'โปรแกรมเมอร์​'),
(6, 'หญิง', 6, 'สมรส', 4, 3, 'ไม่มี', 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ', 'เดินเท้า', 'พนักงานบริษัท kcf'),
(7, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 'ทำงานฝีมือ/งานศิลปะ, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(8, 'ชาย', 5, 'โสด', 5, 1, 'ไม่มี', 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ, ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักวาดภาพ'),
(9, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่​'),
(10, 'หญิง', 1, 'แยกกันอยู่', 8, 7, 'ไม่มี', 'ทำงานฝีมือ/งานศิลปะ, ทำอาหาร, เลี้ยงสัตว์', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'รับจ้างทั่วไป'),
(11, 'ชาย', 3, 'สมรส', 3, 1, 'สามี/ภรรยา', 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'ขับแท็กซี่'),
(12, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่, ​ซ่อม​เครื่อง​ยนต์​การเกษตร​'),
(13, 'ชาย', 3, 'โสด', 3, 1, 'พี่/น้อง', 'ทำงานประดิษฐ์/งานช่าง, เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ช่างไฟฟ้าและเขียนแบบAutocad'),
(14, 'ชาย', 2, 'หม้าย', 3, 1, 'ลูก/หลาน', 'ทำงานประดิษฐ์/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม', 'ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'ช่างซ่อมรถ, ช่างตัดผม'),
(15, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 'ทำงานฝีมือ/งานศิลปะ, เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'เย็บผ้า ปักผ้า'),
(16, 'หญิง', 5, 'โสด', 2, 1, 'ไม่มี', 'ทำอาหาร', 'ด้านคอมพิวเตอร์', 'รถโดยสารประจำทาง', 'พนักงานเอกชน'),
(17, 'หญิง', 2, 'สมรส', 8, 1, 'ไม่มี', 'ทำอาหาร', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(18, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 'ทำอาหาร', 'ด้านภาษา', 'เดินเท้า', 'พนักงานส่งของเคอรี่'),
(19, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 'ทำอาหาร', 'ด้านภาษา, ด้านมนุษย์สัมพันธ์', 'รถยนต์ส่วนตัว, รถจักรยานยนต์ส่วนตัว', 'ค้าขาย'),
(20, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 'ทำอาหาร', 'ด้านการช่าง/ซ่อมแซม', 'เดินเท้า', 'พนักงานโรงงาน'),
(21, 'ชาย', 6, 'โสด', 3, 1, 'ไม่มี', 'ทำอาหาร, ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถโดยสารประจำทาง, เดินเท้า', 'ภารโรง'),
(22, 'หญิง', 5, 'โสด', 3, 1, 'ไม่มี', 'ทำอาหาร, ปลูกต้นไม้', 'ด้านประกอบอาหาร, ด้านคอมพิวเตอร์', 'เดินเท้า', 'พนักงานรัฐวิสาหกิจ'),
(23, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 'ปลูกต้นไม้', 'ด้านการเกษตร', 'รถยนต์ส่วนตัว', 'พนักงาน'),
(24, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ติดรถผู้อื่นไปทำงาน', 'รับจ้างทำการเกษตร'),
(25, 'หญิง', 2, 'สมรส', 3, 4, 'ไม่มี', 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(26, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 'ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์', 'รถโดยสารประจำทาง', 'รับจ้างขายของ หรือทำความสะอาด'),
(27, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 'ปลูกต้นไม้', 'ด้านดนตรี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(28, 'หญิง', 3, 'โสด', 8, 7, 'จ้างคนมาดูแล', 'ปลูกต้นไม้', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(29, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 'ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(30, 'หญิง', 6, 'โสด', 3, 6, 'ไม่มี', 'ไม่มี', 'ด้านตรรกะ, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(31, 'หญิง', 6, 'หม้าย', 2, 2, 'บิดา/มารดา', 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ทำเอกสาร'),
(32, 'หญิง', 3, 'สมรส', 3, 5, 'สามี/ภรรยา', 'ไม่มี', 'ไม่มี', 'ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่ออนไลน์'),
(33, 'หญิง', 6, 'โสด', 9, 4, 'ไม่มี', 'ไม่มี', 'ด้านภาษา', 'รถโดยสารประจำทาง', 'พนักงานราชการ'),
(34, 'หญิง', 2, 'หม้าย', 3, 4, 'ลูก/หลาน', 'ไม่มี', 'ด้านค้าขาย', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(35, 'หญิง', 6, 'สมรส', 2, 1, 'ไม่มี', 'ไม่มี', 'ด้านกีฬา, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'แม่บ้าน'),
(36, 'ชาย', 1, 'โสด', 3, 1, 'ไม่มี', 'ไม่มี', 'ไม่มี', 'เดินเท้า', 'รับจ้างทั่วไป'),
(37, 'ชาย', 3, 'สมรส', 3, 1, 'ไม่มี', 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(38, 'ชาย', 3, 'โสด', 1, 1, 'บิดา/มารดา', 'รับจ้างส่งของ', 'ด้านกีฬา', 'รถยนต์ส่วนตัว', 'รับจ้างส่งของ'),
(39, 'ชาย', 7, 'สมรส', 3, 5, 'สามี/ภรรยา', 'เล่นกีฬา/ออกกำลังกาย', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ขับรถรับจ้าง'),
(40, 'หญิง', 7, 'สมรส', 3, 1, 'ไม่มี', 'เล่นกีฬา/ออกกำลังกาย', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(41, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 'เล่นกีฬา/ออกกำลังกาย', 'ด้านมนุษย์สัมพันธ์', 'เดินเท้า', 'รับจ้างทั่วไป'),
(42, 'ชาย', 6, 'โสด', 3, 1, 'บิดา/มารดา', 'เล่นกีฬา/ออกกำลังกาย, ทำอาหาร', 'ด้านกีฬา', 'รถจักรยานยนต์ส่วนตัว', 'ธุรกิจส่วนตัว'),
(43, 'หญิง', 6, 'โสด', 2, 2, 'บิดา/มารดา', 'เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'จักรยาน', 'พนักงานเอกชน'),
(44, 'ชาย', 6, 'สมรส', 1, 1, 'ไม่มี', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'ทำงานที่บ้าน (WFH)', 'ขายล็อตเตอรี่ เล่นดนตรี และทำงานบริษัท'),
(45, 'ชาย', 6, 'โสด', 9, 1, 'ไม่มี', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'นักดนตรี'),
(46, 'ชาย', 6, 'โสด', 7, 1, 'บิดา/มารดา', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'พนักงานเสิร์ฟอาหาร'),
(47, 'ชาย', 3, 'สมรส', 3, 6, 'ลูก/หลาน', 'เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'พนักงานฟาร์มปศุสัตว์'),
(48, 'ชาย', 3, 'โสด', 3, 7, 'ไม่มี', 'เลี้ยงสัตว์', 'ด้านภาษา', 'ทำงานที่บ้าน (WFH)', 'ทำงานตรวจสอบและวิเคราะหฺ์'),
(49, 'ชาย', 2, 'โสด', 1, 1, 'ไม่มี', 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'เดินเท้า', 'รับจ้างทั่วไป'),
(50, 'ชาย', 2, 'สมรส', 2, 1, 'สามี/ภรรยา', 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'เกษตรกร'),
(51, 'หญิง', 6, 'โสด', 3, 1, 'ไม่มี', 'เลี้ยงสัตว์', 'ด้านภาษา', 'รถยนต์ส่วนตัว', 'พนักงานออฟฟิศ'),
(52, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 'เลี้ยงสัตว์', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(53, 'หญิง', 3, 'สมรส', 3, 1, 'ไม่มี', 'เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(54, 'อื่นๆ', 6, 'โสด', 2, 2, 'ไม่มี', 'เสริมสวย/แต่งหน้า/ทำผม', 'ด้านคอมพิวเตอร์', 'ทำงานที่บ้าน (WFH)', 'เจ้าหน้าที่ธุรการ'),
(55, 'หญิง', 6, 'โสด', 2, 2, 'ไม่มี', 'เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร, ปลูกต้นไม้', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร');

-- --------------------------------------------------------

--
-- Table structure for table `data_newer1`
--

CREATE TABLE `data_newer1` (
  `ID` int(11) NOT NULL,
  `gender` varchar(5) DEFAULT NULL,
  `education` int(1) DEFAULT NULL,
  `status_` varchar(10) DEFAULT NULL,
  `dis_type` int(1) DEFAULT NULL,
  `tool` int(1) DEFAULT NULL,
  `keeper` varchar(17) DEFAULT NULL,
  `invest` int(7) DEFAULT NULL,
  `loan` int(6) DEFAULT NULL,
  `hobby` varchar(200) DEFAULT NULL,
  `aptitude` varchar(200) DEFAULT NULL,
  `commute` varchar(200) DEFAULT NULL,
  `occupation` varchar(42) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `data_newer1`
--

INSERT INTO `data_newer1` (`ID`, `gender`, `education`, `status_`, `dis_type`, `tool`, `keeper`, `invest`, `loan`, `hobby`, `aptitude`, `commute`, `occupation`) VALUES
(1, 'ชาย', 5, 'สมรส', 3, 5, 'ไม่มี', 0, 4000, 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างซ่อมเครื่องยนต์'),
(2, 'ชาย', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถโดยสารประจำทาง, เดินเท้า', 'เก็บขยะ'),
(3, 'หญิง', 6, 'โสด', 2, 2, 'ไม่มี', 0, 30000, 'เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร, ปลูกต้นไม้', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(4, 'หญิง', 2, 'สมรส', 8, 1, 'ไม่มี', 30000, 40000, 'ทำอาหาร', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(5, 'หญิง', 2, 'สมรส', 3, 4, 'ไม่มี', 0, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(6, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 50000, 0, 'ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(7, 'ชาย', 2, 'สมรส', 2, 1, 'สามี/ภรรยา', 0, 0, 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'เกษตรกร'),
(8, 'อื่นๆ', 6, 'โสด', 2, 2, 'ไม่มี', 0, 0, 'เสริมสวย/แต่งหน้า/ทำผม', 'ด้านคอมพิวเตอร์', 'ทำงานที่บ้าน (WFH)', 'เจ้าหน้าที่ธุรการ'),
(9, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'เย็บผ้า ปักผ้า'),
(10, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 50000, 20000, 'ทำอาหาร', 'ด้านภาษา, ด้านมนุษย์สัมพันธ์', 'รถยนต์ส่วนตัว, รถจักรยานยนต์ส่วนตัว', 'แม่ค้า'),
(11, 'หญิง', 3, 'สมรส', 3, 5, 'สามี/ภรรยา', 30000, 0, 'ไม่มี', 'ไม่มี', 'ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่ออนไลน์'),
(12, 'หญิง', 6, 'สมรส', 2, 1, 'ไม่มี', 0, 0, 'ไม่มี', 'ด้านกีฬา, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'แม่บ้าน'),
(13, 'อื่นๆ', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'โปรแกรมเมอร์​'),
(14, 'อื่นๆ', 6, 'สมรส', 3, 6, 'ไม่มี', 20000, 0, 'ทำงานประดิษฐ์/งานช่าง, แต่งรถ', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ไรเดอร์ส่งอาหาร'),
(15, 'ชาย', 3, 'สมรส', 3, 1, 'สามี/ภรรยา', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'ขับแท็กซี่'),
(16, 'ชาย', 7, 'สมรส', 3, 5, 'สามี/ภรรยา', 100000, 10000, 'เล่นกีฬา/ออกกำลังกาย', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ขับรถรับจ้าง'),
(17, 'ชาย', 6, 'สมรส', 1, 1, 'ไม่มี', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'ทำงานที่บ้าน (WFH)', 'ขายล็อตเตอรี่ เล่นดนตรี และทำงานบริษัท'),
(18, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 100000, 20000, 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่​'),
(19, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 100000, 20000, 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่, ​ซ่อม​เครื่อง​ยนต์​การเกษตร​'),
(20, 'หญิง', 3, 'โสด', 8, 7, 'จ้างคนมาดูแล', 0, 10000, 'ปลูกต้นไม้', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(21, 'หญิง', 2, 'หม้าย', 3, 4, 'ลูก/หลาน', 0, 0, 'ไม่มี', 'ด้านค้าขาย', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(22, 'ชาย', 2, 'สมรส', 8, 7, 'ไม่มี', 0, 0, 'ขับเคลื่อนงานด้านองค์กรคนพิการ', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(23, 'ชาย', 3, 'สมรส', 3, 1, 'ไม่มี', 300000, 0, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(24, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(25, 'หญิง', 7, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(26, 'ชาย', 3, 'โสด', 3, 1, 'พี่/น้อง', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ช่างไฟฟ้าและเขียนแบบAutocad'),
(27, 'ชาย', 2, 'หม้าย', 3, 1, 'ลูก/หลาน', 2000, 10000, 'ทำงานประดิษฐ์/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม', 'ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'ช่างซ่อมรถ, ช่างตัดผม'),
(28, 'หญิง', 6, 'หม้าย', 2, 2, 'บิดา/มารดา', 0, 0, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ทำเอกสาร'),
(29, 'ชาย', 3, 'โสด', 3, 7, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านภาษา', 'ทำงานที่บ้าน (WFH)', 'ทำงานตรวจสอบและวิเคราะหฺ์'),
(30, 'ชาย', 6, 'โสด', 3, 1, 'บิดา/มารดา', 0, 0, 'เล่นกีฬา/ออกกำลังกาย, ทำอาหาร', 'ด้านกีฬา', 'รถจักรยานยนต์ส่วนตัว', 'ธุรกิจส่วนตัว'),
(31, 'ชาย', 6, 'โสด', 9, 1, 'ไม่มี', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'นักดนตรีตาบอด'),
(32, 'ชาย', 3, 'โสด', 3, 5, 'ไม่มี', 300000, 0, 'ดูหนังและฟังเพลง', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักลงทุน'),
(33, 'ชาย', 5, 'โสด', 5, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ, ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักวาดภาพ'),
(34, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 200000, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'รถยนต์ส่วนตัว', 'พนักงาน'),
(35, 'ชาย', 6, 'โสด', 7, 1, 'บิดา/มารดา', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'พนักงานเสิร์ฟอาหาร'),
(36, 'หญิง', 5, 'โสด', 2, 1, 'ไม่มี', 0, 0, 'ทำอาหาร', 'ด้านคอมพิวเตอร์', 'รถโดยสารประจำทาง', 'พนักงานเอกชน'),
(37, 'หญิง', 6, 'โสด', 2, 2, 'บิดา/มารดา', 0, 0, 'เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'จักรยาน', 'พนักงานเอกชน'),
(38, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 0, 0, 'ทำอาหาร', 'ด้านการช่าง/ซ่อมแซม', 'เดินเท้า', 'พนักงานโรงงาน'),
(39, 'หญิง', 6, 'สมรส', 4, 3, 'ไม่มี', 3000, 0, 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ', 'เดินเท้า', 'พนักงานบริษัท kcf'),
(40, 'ชาย', 3, 'สมรส', 3, 6, 'ลูก/หลาน', 0, 0, 'เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'พนักงานฟาร์มปศุสัตว์'),
(41, 'หญิง', 5, 'โสด', 3, 1, 'ไม่มี', 0, 20000, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านประกอบอาหาร, ด้านคอมพิวเตอร์', 'เดินเท้า', 'พนักงานรัฐวิสาหกิจ'),
(42, 'หญิง', 6, 'โสด', 9, 4, 'ไม่มี', 0, 0, 'ไม่มี', 'ด้านภาษา', 'รถโดยสารประจำทาง', 'พนักงานราชการ'),
(43, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำอาหาร', 'ด้านภาษา', 'เดินเท้า', 'พนักงานส่งของเคอรี่'),
(44, 'หญิง', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านภาษา', 'รถยนต์ส่วนตัว', 'พนักงานออฟฟิศ'),
(45, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์', 'รถโดยสารประจำทาง', 'รับจ้างขายของ หรือทำความสะอาด'),
(46, 'หญิง', 1, 'แยกกันอยู่', 8, 7, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, ทำอาหาร, เลี้ยงสัตว์', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'รับจ้างทั่วไป'),
(47, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 5000, 0, 'ปลูกต้นไม้', 'ด้านดนตรี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(48, 'หญิง', 6, 'โสด', 3, 6, 'ไม่มี', 0, 40000, 'ไม่มี', 'ด้านตรรกะ, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(49, 'ชาย', 1, 'โสด', 3, 1, 'ไม่มี', 0, 20000, 'ไม่มี', 'ไม่มี', 'เดินเท้า', 'รับจ้างทั่วไป'),
(50, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านมนุษย์สัมพันธ์', 'เดินเท้า', 'รับจ้างทั่วไป'),
(51, 'ชาย', 2, 'โสด', 1, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'เดินเท้า', 'รับจ้างทั่วไป'),
(52, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 50000, 20000, 'เลี้ยงสัตว์', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(53, 'หญิง', 3, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(54, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 184000, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ติดรถผู้อื่นไปทำงาน', 'รับจ้างทำการเกษตร'),
(55, 'ชาย', 3, 'โสด', 1, 1, 'บิดา/มารดา', 0, 0, 'รับจ้างส่งของ', 'ด้านกีฬา', 'รถยนต์ส่วนตัว', 'รับจ้างส่งของ');

-- --------------------------------------------------------

--
-- Table structure for table `data_thesis`
--

CREATE TABLE `data_thesis` (
  `id` int(11) NOT NULL,
  `age` int(3) DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `education` varchar(20) DEFAULT NULL,
  `status_` varchar(10) DEFAULT NULL,
  `dis_type` varchar(100) DEFAULT NULL,
  `tool` varchar(30) DEFAULT NULL,
  `keeper` varchar(30) DEFAULT NULL,
  `invest` varchar(7) DEFAULT NULL,
  `loan` varchar(7) DEFAULT NULL,
  `hobby` varchar(200) DEFAULT NULL,
  `aptitude` varchar(200) DEFAULT NULL,
  `commute` varchar(200) DEFAULT NULL,
  `occupation` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `data_thesis`
--

INSERT INTO `data_thesis` (`id`, `age`, `gender`, `education`, `status_`, `dis_type`, `tool`, `keeper`, `invest`, `loan`, `hobby`, `aptitude`, `commute`, `occupation`) VALUES
(1, 31, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำอาหาร, ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'รถโดยสารประจำทาง, เดินเท้า', 'เก็บขยะ'),
(2, 28, 'หญิง', 'มัธยมศึกษา', 'โสด', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'เครื่องช่วยฟัง', 'ไม่มี', 'ไม่มี', '30000', 'เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร, ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(3, 68, 'หญิง', 'ประถมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำอาหาร', 'ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(4, 79, 'หญิง', 'ประถมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้เท้า', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(5, 64, 'ชาย', 'ประถมศึกษา', 'สมรส', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'ไม่มี', 'ภรรยา', '30000', '40000', 'เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'เกษตรกร'),
(6, 71, 'ชาย', 'ประถมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ภรรยา', '50000', 'ไม่เคย', 'ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(7, 57, 'ชาย', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ภรรยา', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'ขับแท็กซี่'),
(8, 55, 'ชาย', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้ค้ำยัน', 'ภรรยา', '100000', '10000', 'เล่นกีฬา/ออกกำลังกาย', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ขับรถรับจ้าง'),
(9, 36, 'ชาย', 'ปริญญาตรี', 'สมรส', 'ด้านการมองเห็น (ตาบอด 1 ข้าง)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'ทำงานที่บ้าน (WFH)', 'ขายล็อตเตอรี่ เล่นดนตรี และทำงานบริษัท'),
(10, 54, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'วิลแชร์​', 'น้อง​สะใภ้​', '100000', '20000', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่​'),
(11, 54, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'วิลแชร์​', 'น้อง​สะใภ้​', '100000', '20000', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่, ​ซ่อม​เครื่อง​ยนต์​การเกษตร​'),
(12, 38, 'หญิง', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'วิลแชร์​', 'จ้างคนมาดูแล', 'ไม่มี', '10,000', 'ปลูกต้นไม้', 'ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(13, 49, 'หญิง', 'ประถมศึกษา', 'หม้าย', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้เท้า', 'ลูก', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ด้านค้าขาย', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(14, 60, 'ชาย', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'วิลแชร์​', 'ไม่มี', '300000', 'ไม่เคย', 'ขับเคลื่อนงานด้านองค์กรคนพิการ', 'ด้านศิลปะ/การช่าง', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(15, 50, 'ชาย', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(16, 30, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(17, 40, 'หญิง', 'สูงกว่าปริญญาตรี', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เล่นกีฬา/ออกกำลังกาย', 'ด้านภาษา, ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(18, 36, 'อื่นๆ', 'ปริญญาตรี', 'โสด', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'เครื่องช่วยฟัง', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เสริมสวย/แต่งหน้า/ทำผม', 'ด้านคอมพิวเตอร์', 'ทำงานที่บ้าน (WFH)', 'เจ้าหน้าที่ธุรการ'),
(19, 63, 'ชาย', 'ประถมศึกษา', 'หม้าย', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'หลาน', '2,000', '10,000', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม', 'ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'ช่างซ่อมรถ, ช่างตัดผม'),
(20, 42, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'พี่สาว', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'ช่างไฟฟ้าและเขียนแบบAutocad'),
(21, 55, 'ชาย', 'สูงกว่าปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้เท้า, วิลแชร์', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เลี้ยงสัตว์', 'ด้านภาษา', 'ทำงานที่บ้าน (WFH)', 'ทำงานตรวจสอบและวิเคราะหฺ์'),
(22, 45, 'หญิง', 'ปริญญาตรี', 'หม้าย', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'เครื่องช่วยฟัง', 'บิดา/มารดา', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ทำเอกสาร'),
(23, 39, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'บิดา', 'ไม่มี', 'ไม่เคย', 'เล่นกีฬา/ออกกำลังกาย, ทำอาหาร', 'ด้านกีฬา', 'รถจักรยานยนต์ส่วนตัว', 'ธุรกิจส่วนตัว'),
(24, 41, 'ชาย', 'ปวช./ปวส.', 'โสด', 'ด้านการมองเห็น (ตาบอด 2 ข้าง)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'นักดนตรีตาบอด'),
(25, 57, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้ค้ำยัน', 'ไม่มี', '300,000', 'ไม่เคย', 'ดูหนังและฟังเพลง', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักลงทุน'),
(26, 28, 'ชาย', 'ปริญญาตรี', 'โสด', 'ออทิสติก', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักวาดภาพ'),
(27, 35, 'อื่นๆ', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/การช่าง, ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'ทำงานที่บ้าน (WFH)', 'โปรแกรมเมอร์​'),
(28, 31, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม', 'มารดา', '200,000', 'ไม่เคย', 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'รถยนต์ส่วนตัว', 'พนักงาน'),
(29, 30, 'หญิง', 'มัธยมศึกษา', 'สมรส', 'ด้านการได้ยิน (เป็นใบ้ พูดไม่ได้)', 'เขียนพิมพ์สื่อสาร', 'การช่วยเหลือจากบริษัท', '3000', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง,', 'ด้านศิลปะ/การช่าง', 'เดินเท้า', 'พนักงานบริษัท kcf'),
(30, 60, 'ชาย', 'ประถมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม', 'ลูก', 'ไม่มี', 'ไม่เคย', 'เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถยนต์ส่วนตัว', 'พนักงานฟาร์มปศุสัตว์'),
(31, 41, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', '20,000', 'ทำอาหาร, ปลูกต้นไม้', 'ด้านประกอบอาหาร ด้านคอมพิวเตอร์', 'เดินเท้า', 'พนักงานรัฐวิสาหกิจ'),
(32, 25, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการมองเห็น (ตาบอด 2 ข้าง)', 'ไม้เท้า', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ด้านภาษา', 'รถโดยสารประจำทาง', 'พนักงานราชการ'),
(33, 47, 'ชาย', 'ประถมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ภรรยา', 'ไม่มี', 'ไม่เคย', 'ทำอาหาร', 'ด้านศิลปะ/การช่าง', 'เดินเท้า', 'พนักงานโรงงาน'),
(34, 28, 'ชาย', 'ปวช./ปวส.', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำอาหาร', 'ด้านภาษา', 'เดินเท้า', 'พนักงานส่งของเคอรี่'),
(35, 27, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านจิตใจหรือพฤติกรรม', 'ไม่มี', 'มารดา', 'ไม่มี', 'ไม่เคย', 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'พนักงานเสิร์ฟอาหาร'),
(36, 27, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เลี้ยงสัตว์', 'ด้านภาษา', 'รถยนต์ส่วนตัว', 'พนักงานออฟฟิศ'),
(37, 60, 'หญิง', 'ปวช./ปวส.', 'โสด', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำอาหาร', 'ด้านคอมพิวเตอร์', 'รถโดยสารประจำทาง', 'พนักงานเอกชน'),
(38, 35, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'เครื่องช่วยฟัง', 'บิดา/มารดา', 'ไม่มี', 'ไม่เคย', 'เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง, ด้านธรรมชาติ/การเกษตร', 'จักรยาน', 'พนักงานเอกชน'),
(39, 43, 'หญิง', 'ปวช./ปวส.', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', '50,000', '20000', 'ทำอาหาร', 'ด้านภาษา, ด้านมนุษย์สัมพันธ์', 'รถยนต์ส่วนตัว, รถจักรยานยนต์ส่วนตัว', 'แม่ค้า'),
(40, 42, 'หญิง', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้ค้ำยัน', 'สามี', '30000', 'ไม่เคย', 'ไม่มี', 'ไม่มี', 'ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่ออนไลน์'),
(41, 37, 'หญิง', 'ปวช./ปวส.', 'สมรส', 'ด้านการได้ยิน (หูตึง หรือ ใส่เครื่องช่วยฟัง)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ด้านการเคลื่อนไหว, ด้านมนุษย์สัมพันธ์, ด้านธรรมชาติ/การเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'แม่บ้าน'),
(42, 43, 'หญิง', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร', 'ด้านศิลปะ/การช่าง', 'ทำงานที่บ้าน (WFH)', 'เย็บผ้า ปักผ้า'),
(43, 65, 'ชาย', 'ประถมศึกษา', 'โสด', 'ด้านการมองเห็น (ตาบอด 1 ข้าง)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'เลี้ยงสัตว์', 'ด้านธรรมชาติ/การเกษตร', 'เดินเท้า', 'รับจ้างทั่วไป'),
(44, 33, 'หญิง', 'ไม่มี', 'แยกกันอยู่', 'ด้านการเคลื่อนไหว (ไม่สามารถเดินได้)', 'วิลแชร์​', 'ไม่มี', '5000', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, ทำอาหาร, เลี้ยงสัตว์', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'รับจ้างทั่วไป'),
(45, 47, 'ชาย', 'ไม่มี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ไม่มี', 'เดินเท้า', 'รับจ้างทั่วไป'),
(46, 37, 'หญิง', 'ปริญญาตรี', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', '40,000', 'เลี้ยงสัตว์', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(47, 51, 'ชาย', 'ปวช./ปวส.', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ปลูกต้นไม้', 'ด้านดนตรี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(48, 56, 'หญิง', 'มัธยมศึกษา', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', '50000', '20000', 'เลี้ยงสัตว์', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(49, 46, 'ชาย', 'ปวช./ปวส.', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', '20000', 'เล่นกีฬา/ออกกำลังกาย', 'ด้านมนุษย์สัมพันธ์', 'เดินเท้า', 'รับจ้างทั่วไป'),
(50, 29, 'หญิง', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม, ไม้ค้ำยัน', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ไม่มี', 'ด้านตรรกะ, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(51, 43, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม่มี', 'ไม่มี', 'ไม่มี', 'ไม่เคย', 'ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์', 'รถโดยสารประจำทาง', 'รับจ้างขายของ หรือทำความสะอาด'),
(52, 40, 'ชาย', 'ปวช./ปวส.', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ไม้ค้ำยัน', 'ไม่มี', 'ไม่มี', '4000', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างซ่อมเครื่องยนต์'),
(53, 32, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม', 'มารดา', '184,000', 'ไม่เคย', 'ปลูกต้นไม้', 'ด้านธรรมชาติ/การเกษตร', 'ติดรถผู้อื่นไปทำงาน', 'รับจ้างทำการเกษตร'),
(54, 44, 'ชาย', 'มัธยมศึกษา', 'โสด', 'ด้านการมองเห็น (ตาบอด 1 ข้าง)', 'ไม่มี', 'มารดา', 'ไม่มี', 'ไม่เคย', 'รับจ้างส่งของ', 'ด้านการเคลื่อนไหว', 'รถยนต์ส่วนตัว', 'รับจ้างส่งของ'),
(55, 32, 'อื่นๆ', 'ปริญญาตรี', 'สมรส', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม', 'ไม่มี', '20000', 'ไม่เคย', 'ทำงานฝีมือ/งานศิลปะ/งานช่าง, แต่งรถ', 'ด้านศิลปะ/การช่าง', 'รถจักรยานยนต์ส่วนตัว', 'ไรเดอร์ส่งอาหาร'),
(56, 26, 'ชาย', 'ปริญญาตรี', 'โสด', 'ด้านการเคลื่อนไหว (ยังสามารถเดินได้)', 'ขาเทียม', 'ครอบครัว', 'ไม่มี', 'ไม่เคย', 'ต่อกันดั้ม สะสมของเล่น', 'ด้านตรรกะ', 'ทำงานที่บ้าน (WFH)', 'หมอ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `data_new`
--
ALTER TABLE `data_new`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `data_newer`
--
ALTER TABLE `data_newer`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `data_newer1`
--
ALTER TABLE `data_newer1`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `data_thesis`
--
ALTER TABLE `data_thesis`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `data_new`
--
ALTER TABLE `data_new`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `data_newer`
--
ALTER TABLE `data_newer`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `data_newer1`
--
ALTER TABLE `data_newer1`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `data_thesis`
--
ALTER TABLE `data_thesis`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
